Repository: zipf/perldoc-es
Catalog: _reference/legacy_materials/omegat_memory/project_save.tmx
Source language: en_us
Languages: es_es

# die "Can't cd to spool: $! " unless chdir '/usr/spool/news';
source: die "Can't cd to spool: $!\n" unless chdir '/usr/spool/news';
es_es: die "No puedo cd a spool: $!\n" unless chdir '/usr/spool/news';

# chdir '/usr/spool/news' or die "Can't cd to spool: $! "
source: chdir '/usr/spool/news' or die "Can't cd to spool: $!\n"
es_es: chdir '/usr/spool/news' or die "No puedo cd a spool: $!\n"

source: If the last element of LIST does not end in a newline, the current script line number and input line number (if any) are also printed, and a newline is supplied.
es_es: Si el último elemento de LISTA no acaba en el carácter de nueva línea, se imprimen también el valor actual del número de línea y el actual número de línea de entrada (si existe), junto con un carácter de nueva línea.

source: Note that the "input line number" (also known as "chunk") is subject to whatever notion of "line" happens to be currently in effect, and is also available as the special variable C<$.>.
es_es: Note que el "número de línea de entrada" (también conocido como "chunk" -tarugo-) está sujeto a cualquier noción de "línea" que sea efectiva en ese momento, y también está disponible en la variable especial C<$.>.

source: See L<perlvar/"$/"> and L<perlvar/"$.">.
es_es: Ver L<perlvar/"$/"> y L<perlvar/"$.">.

source: Hint: sometimes appending C<", stopped"> to your message will cause it to make better sense when the string C<"at foo line 123"> is appended.
es_es: Consejo: algunas veces añadir C<", parado"> a tu mensaje hará aparecerle con un sentido mejor cuando se le añada el string C<"at foo line 123">.

source: Suppose you are running script "canasta".
es_es: Suponga que está corriendo el script "canasta".

source: die "/etc/games is no good";
es_es: die "/etc/games no está bien";

source: die "/etc/games is no good, stopped";
es_es: die "/etc/games no está bien, parado";

source: produce, respectively
es_es: produce, respectivamente

source: /etc/games is no good at canasta line 123.
es_es: /etc/games no está bien at canasta line 123.

source: /etc/games is no good, stopped at canasta line 123.
es_es: /etc/games no está bien, parado at canasta line 123.

source: See also exit(), warn(), and the Carp module.
es_es: Ver también exit(), warn() y el módulo Carp.

source: If LIST is empty and C<$@> already contains a value (typically from a previous eval) that value is reused after appending C<"\t...propagated">.
es_es: Si la LISTA está vacía y C<$@> ya contiene un valor (típicamente de un eval anterior) este valor es reusado después de añadirle C<"\t...propagated">.

source: This is useful for propagating exceptions:
es_es: Esto es útil para propagar excepciones:

source: die unless $@ =~ /Expected exception/;
es_es: die unless $@ =~ /Excepción esperada/;

source: If LIST is empty and C<$@> contains an object reference that has a C<PROPAGATE> method, that method will be called with additional file and line number parameters.
es_es: Si LISTA está vacía y C<$@> contiene una referencia a un objeto que tiene un método C<PROPAGATE>, éste método será llamado con los parámetros adicionales del fichero y número de línea.

source: The return value replaces the value in C<$@>.
es_es: El valor de retorno reemplaza el valor en C<$@>.

source: i.e. as if C<< $@ = eval { $@->PROPAGATE(__FILE__, __LINE__) }; >> were called.
es_es: es decir, como si se ejecutara C<< $@ = eval { $@->PROPAGATE(__FILE__, __LINE__) }; >>.

source: If C<$@> is empty then the string C<"Died"> is used.
es_es: Si C<$@> está vacío entonces se usa el string C<"Died">.

source: die() can also be called with a reference argument.
es_es: die() puede ser llamada también con una referencia como argumento.

source: If this happens to be trapped within an eval(), $@ contains the reference.
es_es: Si ocurre que es atrapado dentro de un eval(), $@ contiene la referencia.

source: This behavior permits a more elaborate exception handling implementation using objects that maintain arbitrary state about the nature of the exception.
es_es: Este comportamiento permite una implementación del manejo de las excepciones más elaborada usando objetos que mantienen el estado sobre la naturaleza de la excepción.

source: Such a scheme is sometimes preferable to matching particular string values of $@ using regular expressions.
es_es: Tal esquema es algunas veces preferible a emparejar strings particulares de $@ usando expresiones regulares.

source: Here's an example:
es_es: Aquí hay un ejemplo:

source: # handle Some::Module::Exception
es_es: # procesar Some::Module::Exception

source: # handle all other possible exceptions
es_es: # procesar el resto de posibles excepciones

source: Because perl will stringify uncaught exception messages before displaying them, you may want to overload stringification operations on such custom exception objects.
es_es: Como Perl convertirá en cadena de caracteres los mensajes de excepción no capturados antes de mostrarlos, quizás quiera sobrecargar las operaciones de conversión a cadena en objetos de excepción propios.

source: See L<overload> for details about that.
es_es: Ver L<overload> para los detalles sobre esto.

source: You can arrange for a callback to be run just before the C<die> does its deed, by setting the C<$SIG{__DIE__}> hook.
es_es: Puede disponer que una retrollamada se ejecute antes de que C<die> haga sus funciones, actualizando el gancho C<$SIG{__DIE__}>.

source: The associated handler will be called with the error text and can change the error message, if it sees fit, by calling C<die> again.
es_es: El manejador asociado será llamado con el texto del error y puede cambiar el mensaje de error, si le parece, llamando de nuevo a C<die>.

source: See L<perlvar/$SIG{expr}> for details on setting C<%SIG> entries, and L<"eval BLOCK"> for some examples.
es_es: Ver L<perlvar/$SIG{expr}> para los detalles sobre cómo colocar entradas C<%SIG> y L<"eval BLOCK"> para algunos ejemplos.

source: Although this feature was to be run only right before your program was to exit, this is not currently the case--the C<$SIG{__DIE__}> hook is currently called even inside eval()ed blocks/strings!
es_es: Aunque esta característica está preparada para ser ejecutada sólo antes de que el programa termine, este no es el caso: el gancho C<$SIG{__DIE__}>, ¡es llamado incluso dentro de cadenas y bloques eval()uados!

source: If one wants the hook to do nothing in such situations, put
es_es: Si uno quiere que el gancho no haga nada en estas situaciones, ponga

source: as the first line of the handler (see L<perlvar/$^S>).
es_es: como primera línea del manejador (ver L<perlvar/$^S>).

source: Because this promotes strange action at a distance, this counterintuitive behavior may be fixed in a future release.
es_es: Debido a que provoca una acción extraña a gran distancia, este comportamiento no intuitivo puede ser arreglado en una distribución futura.

source: =item do BLOCK X<do> X<block>
es_es: =item do BLOQUE X<do> X<block> X<bloque>

source: Not really a function.
es_es: No es realmente una función.

source: Returns the value of the last command in the sequence of commands indicated by BLOCK.
es_es: Devuelve el valor del último comando en la secuencia de comandos indicada por BLOQUE.

source: When modified by the C<while> or C<until> loop modifier, executes the BLOCK once before testing the loop condition.
es_es: Cuando se encuentra acompañado por los modificadores de bucle C<while> o C<until>, ejecuta el BLOQUE una vez antes de comprobar la condición del bucle.

source: (On other statements the loop modifiers test the conditional first.)
es_es: (En otras sentencias los modificadores de bucle comprueban primero la condición).

source: C<do BLOCK> does I<not> count as a loop, so the loop control statements C<next>, C<last>, or C<redo> cannot be used to leave or restart the block.
es_es: C<do BLOQUE> I<no> cuenta como un bucle, así que las sentencias de control de bucle C<next>, C<last>, o C<redo> no pueden ser usadas para dejar o reiniciar el bloque.

source: See L<perlsyn> for alternative strategies.
es_es: Ver L<perlsyn> para estrategias alternativas.

source: =item do SUBROUTINE(LIST) X<do>
es_es: =item do SUBRUTINA(LISTA) X<do>

source: This form of subroutine call is deprecated.
es_es: Esta forma de llamada de subrutina ha sido depreciada.

source: See L<perlsub>.
es_es: Ver L<perlsub>.

source: Uses the value of EXPR as a filename and executes the contents of the file as a Perl script.
es_es: Usa el valor de EXPR como el nombre de un fichero y ejecuta los contenidos del fichero como un script Perl.

source: is just like
es_es: es igual que

source: except that it's more efficient and concise, keeps track of the current filename for error messages, searches the @INC directories, and updates C<%INC> if the file is found.
es_es: excepto que es más eficiente y conciso, mantiene el nombre del fichero en los mensajes de error, busca en los directorios @INC y actualiza C<%INC> si el fichero es encontrado.

source: See L<perlvar/Predefined Names> for these variables.
es_es: Ver L<perlvar/Nombres predefinidos> para estas variables.

source: It also differs in that code evaluated with C<do FILENAME> cannot see lexicals in the enclosing scope; C<eval STRING> does.
es_es: También difiere en que el código evaluado con C<do NOMBREFICHERO> no puede ver a las variables léxicas en el ámbito en que se ejecuta; C<eval STRING> sí.

source: It's the same, however, in that it does reparse the file every time you call it, so you probably don't want to do this inside a loop.
es_es: Es lo mismo, sin embargo, en que vuelve a parsear el fichero cada vez que lo llama, así que, probablemente, no querrá hacer esto dentro de un bucle.

source: If C<do> cannot read the file, it returns undef and sets C<$!> to the error.
es_es: Si C<do> no puede leer el fichero, devuelve undef y pone C<$!> al valor del error.

source: If C<do> can read the file but cannot compile it, it returns undef and sets an error message in C<$@>.
es_es: Si C<do> puede leer el fichero pero no puede compilarlo, devuelve undef y pone un mensaje de error en C<$@>.

source: If the file is successfully compiled, C<do> returns the value of the last expression evaluated.
es_es: Si el fichero se compila bien, C<do> devuelve el valor de la última expresión evaluada.

source: Note that inclusion of library modules is better done with the C<use> and C<require> operators, which also do automatic error checking and raise an exception if there's a problem.
es_es: Note que la inclusión de bibliotecas de módulos es mejor hacerla con los operadores C<use> y C<require>, que también hacen comprobación automática de errores y generan una excepción si existe algún problema.

source: You might like to use C<do> to read in a program configuration file.
es_es: Puede usar C<do> para leer en un programa un fichero de configuración.

source: Manual error checking can be done this way:
es_es: Comprobación manual de errores se puede hacer así:

source: # read in config files: system first, then user
es_es: # leer en ficheros de configuración: primero el sistema, luego el usuario

source: for $file ("/share/prog/defaults.rc",
es_es: for $fichero ("/share/prog/defaults.rc",

source: { unless ($return = do $file) { warn "couldn't parse $file: $@" if $@; warn "couldn't do $file: $!" unless defined $return; warn "couldn't run $file" unless $return; }
es_es: { unless ($return = do $fichero) { warn "no puedo parsear $fichero: $@" if $@; warn "no puedo hacer $fichero: $!" unless defined $return; warn "no puedo ejecutar $fichero" unless $return; }

source: =item dump LABEL X<dump> X<core> X<undump>
es_es: =item dump ETIQUETA X<dump> X<core> X<undump>

source: This function causes an immediate core dump.
es_es: Esta función provoca un volcado inmediato del núcleo de ejecución.

source: See also the B<-u> command-line switch in L<perlrun>, which does the same thing.
es_es: Ver también la opción de línea de comando B<-u> en L<perlrun>, que hace lo mismo.

source: Primarily this is so that you can use the B<undump> program (not supplied) to turn your core dump into an executable binary after having initialized all your variables at the beginning of the program.
es_es: Principalmente esto se utiliza en conjunción con el programa B<undump> (no suministrado) para convertir tu volcado del núcleo en un binario ejecutable después de haber inicializado todas las variables al comienzo del programa.

source: When the new binary is executed it will begin by executing a C<goto LABEL> (with all the restrictions that C<goto> suffers).
es_es: Cuando el nuevo binario es ejecutado, comenzará ejecutando un C<goto ETIQUETA> (con todas las restricciones que C<goto> padece).

source: Think of it as a goto with an intervening core dump and reincarnation.
es_es: Piense en él como un goto entre un volcado del núcleo y una reencarnación.

source: If C<LABEL> is omitted, restarts the program from the top.
es_es: Si se omite C<ETIQUETA>, reinicia el programa desde el principio.

source: B<WARNING>: Any files opened at the time of the dump will I<not> be open any more when the program is reincarnated, with possible resulting confusion on the part of Perl.
es_es: B<ATENCIÓN>: Cualquier fichero abierto en el momento del volcado I<no> será abierto cuando el programa sea reencarnado, con una muy posible confusión por parte de Perl.

source: This function is now largely obsolete, partly because it's very hard to convert a core file into an executable, and because the real compiler backends for generating portable bytecode and compilable C code have superseded it.
es_es: Esta función es obsoleta desde hace mucho tiempo, en parte porque es muy difícil convertir un volcado del núcleo en un ejecutable, y porque el compilador incorporado para generar bytecode portable y el compilador de código C lo han superado ampliamente.

source: That's why you should now invoke it as C<CORE::dump()>, if you don't want to be warned against a possible typo.
es_es: Y así es por qué debe invocarlo como C<CORE::dump()>, si no quiere ser avisado de que posiblemente ha cometido una falta ortográfica.

source: If you're looking to use L<dump> to speed up your program, consider generating bytecode or native C code as described in L<perlcc>.
es_es: Si está pensando usar L<dump> para aumentar la velocidad de un programa, considerar el generar bytecode o código nativo C, tal como se describe en L<perlcc>.

source: If you're just trying to accelerate a CGI script, consider using the C<mod_perl> extension to B<Apache>, or the CPAN module, CGI::Fast.
es_es: Si sólo está intentando acelerar un guión CGI, considere usar la extensión C<mod_perl> en B<Apache>, o el módulo de CPAN, CGI::Fast.

source: You might also consider autoloading or selfloading, which at least make your program I<appear> to run faster.
es_es: Puede también considerar el método de autocarga, que le hará I<parecer> que su programa corre más rápido.

source: =item each HASH X<each> X<hash, iterator>
es_es: =item each HASH X<each> X<hash, iterator> X<iterador>

source: When called in list context, returns a 2-element list consisting of the key and value for the next element of a hash, so that you can iterate over it.
es_es: Cuando se llama en contexto lista, devuelve una lista de dos elementos consistentes en la clave y el valor del siguiente elementos del hash, así que de esta manera puede iterar por el.

source: When called in scalar context, returns only the key for the next element in the hash.
es_es: Cuando se le llama en contexto escalar, sólo devuelve la clave del siguiente elemento del hash.

source: Entries are returned in an apparently random order.
es_es: Las entradas son devueltas en un aparente orden aleatorio.

source: The actual random order is subject to change in future versions of perl, but it is guaranteed to be in the same order as either the C<keys> or C<values> function would produce on the same (unmodified) hash.
es_es: El actual orden aleatorio está sujeto a cambio en futuras versiones de Perl, pero está garantizado que sea en el mismo orden que las funciones C<keys> o C<values> producirían sobre el mismo hash.

source: Since Perl 5.8.1 the ordering is different even between different runs of Perl for security reasons (see L<perlsec/"Algorithmic Complexity Attacks">).
es_es: Desde Perl 5.8.1 la ordenación es diferente incluso entre diferentes ejecuciones de Perl por razones de seguridad (ver L<perlsec/"Ataques por Complejidad Algorítmica">).

source: When the hash is entirely read, a null array is returned in list context (which when assigned produces a false (C<0>) value), and C<undef> in scalar context.
es_es: Cuando se haya leído completamente el hash, se devuelve un array nulo en contexto lista (que cuando es asignado produce un valor falso (C<0>)) y un C<undef> en contexto escalar.

source: The next call to C<each> after that will start iterating again.
es_es: La siguiente llamada a C<each> reiniciará la iteración.

source: There is a single iterator for each hash, shared by all C<each>, C<keys>, and C<values> function calls in the program; it can be reset by reading all the elements from the hash, or by evaluating C<keys HASH> or C<values HASH>.
es_es: Existe un único iterador por cada hash, compartido por las llamadas a las funciones C<each>, C<keys> y C<values> en el programa; puede ser reinicializado leyendo todos los elementos del hash, o evaluando C<keys HASH> o C<values HASH>.

source: If you add or delete elements of a hash while you're iterating over it, you may get entries skipped or duplicated, so don't.
es_es: Si añades o borras elementos de un hash mientras está iterando sobre él, puede encontrarse con entradas desaparecidas o duplicadas, así que no lo haga.

source: Exception: It is always safe to delete the item most recently returned by C<each()>, which means that the following code will work:
es_es: Excepción: Siempre es seguro borrar el último item devuelto por C<each()>, por lo que entonces el siguiente código funcionará:

source: while (($key, $value) = each %hash) {
es_es: while (($clave, $valor) = each %hash) {

# print $key, " ";
source: print $key, "\n";
es_es: print $clave, "\n";

source: delete $hash{$key}; # This is safe
es_es: delete $hash{$clave}; # Esto es seguro

source: The following prints out your environment like the printenv(1) program, only in a different order:
es_es: Lo siguiente imprime su entorno como el programa printenv(1), sólo que en un orden diferente:

# while (($key,$value) = each %ENV) { print "$key=$value ";
source: while (($key,$value) = each %ENV) { print "$key=$value\n";
es_es: while (($clave,$valor) = each %ENV) { print "$clave=$valor\n";

source: See also C<keys>, C<values> and C<sort>.
es_es: Ver también C<keys>, C<values> y C<sort>.

source: =item eof FILEHANDLE X<eof> X<end of file> X<end-of-file>
es_es: =item eof MANEJADORFICHERO X<eof> X<end of file> X<fin de fichero> X<end-of-file>

source: Returns 1 if the next read on FILEHANDLE will return end of file, or if FILEHANDLE is not open.
es_es: Devuelve 1 si el la siguiente lectura sobre MANEJADORFICHERO devolverá un fin de fichero, o si MANEJADORFICHERO no está abierto.

source: FILEHANDLE may be an expression whose value gives the real filehandle.
es_es: MANEJADORFICHERO puede ser una expresión cuyo valor da el manejador real.

source: (Note that this function actually reads a character and then C<ungetc>s it, so isn't very useful in an interactive context.) Do not read from a terminal file (or call C<eof(FILEHANDLE)> on it) after end-of-file is reached.
es_es: (Note que esta función realmente lee un carácter y luego lo C<ungetc>, así que no es muy útil en un contexto interactivo). No lea de un fichero que se ha terminado (o llame a C<eof(MANEJADORFICHERO)> sobre él) después de obtener un fin-de-fichero.

source: File types such as terminals may lose the end-of-file condition if you do.
es_es: Tipos de ficheros como por ejemplo terminales pueden perder la condición de fin-de-fichero si lo hace.

source: An C<eof> without an argument uses the last file read.
es_es: Un C<eof> sin argumento usa el último fichero leído.

source: Using C<eof()> with empty parentheses is very different.
es_es: Usar C<eof()> con paréntesis vacíos es muy diferente.

source: It refers to the pseudo file formed from the files listed on the command line and accessed via the C<< <> >> operator.
es_es: Se refiere a un pseudo fichero formado por los ficheros listados en la línea de comandos y accedidos vía el operador C<< <> >>.

source: Since C<< <> >> isn't explicitly opened, as a normal filehandle is, an C<eof()> before C<< <> >> has been used will cause C<@ARGV> to be examined to determine if input is available.
es_es: Como C<< <> >> no es explícitamente abierto, como lo sería un manejador de fichero, un C<eof()> antes de que un C<< <> >> sea usado, causará que C<@ARGV> sea examinado para determinar si la entrada está disponible.

source: Similarly, an C<eof()> after C<< <> >> has returned end-of-file will assume you are processing another C<@ARGV> list, and if you haven't set C<@ARGV>, will read input from C<STDIN>; see L<perlop/"I/O Operators">.
es_es: De forma semejante, un C<eof()> después de que un C<< <> >> haya devuelto un fin-de-fichero asumirá que está procesando otra lista C<@ARGV>, y si no ha puesto un nuevo C<@ARGV>, leerá la entrada desde C<STDIN>; ver L<perlop/"Operadores E/S">.

source: In a C<< while (<>) >> loop, C<eof> or C<eof(ARGV)> can be used to detect the end of each file, C<eof()> will only detect the end of the last file.
es_es: En un bucle C<< while (<>) >>, C<eof> o C<eof(ARGV)> pueden usarse para detectar el fin de un fichero; C<eof()> sólo detectará el final del último fichero.

source: # reset line numbering on each input file
es_es: # reiniciar el numerado de líneas en cada fichero de entrada

# while (<>) { next if /^s*#/; # skip comments print "$. $_";
source: while (<>) { next if /^\s*#/; # skip comments print "$.\t$_";
es_es: while (<>) { next if /^\s*#/; # salta comentarios print "$.\t$_";

source: } continue { close ARGV if eof; # Not eof()!
es_es: } continue { close ARGV if eof; # No eof()!

source: # insert dashes just before last line of last file
es_es: # inserta guiones justo antes de la última línea del último fichero

source: while (<>) { if (eof()) { # check for end of last file print "--------------\n"; } print; last if eof(); # needed if we're reading from a terminal
es_es: while (<>) { if (eof()) { # testea final del último fichero print "--------------\n"; } print; last if eof(); # necesario si estamos leyendo de una terminal

source: Practical hint: you almost never need to use C<eof> in Perl, because the input operators typically return C<undef> when they run out of data, or if there was an error.
es_es: Truco práctico: casi nunca necesita usar C<eof> en Perl, porque los operadores de entrada normalmente devuelven C<undef> cuando no hay más datos, o si ocurrió un error.

source: =item eval BLOCK
es_es: =item eval BLOQUE

source: In the first form, the return value of EXPR is parsed and executed as if it were a little Perl program.
es_es: En la primera forma, el valor devuelto por EXPR es parseado y ejecutado como si fuera un pequeño programa Perl.
